netify-soap/src/test/resources/soap/requests/role/GetRoleAllRequestFilterActorIdTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general"
                  xmlns:role="http://mouthaan.org/namespace/netify/datatypes/role">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetRoleAllRequest>
            <!--Optional:-->
            <gen:filters>
                <!--Optional:-->
                <role:actorId>1892</role:actorId>
            </gen:filters>
        </gen:GetRoleAllRequest>
    </soapenv:Body>
</soapenv:Envelope>